 #!/bin/bash - для создания команд в начале пишут это в "nano"

cat - читать файлы

cp - скапировать файл

cd - переместиться домой(гуляя по папкам используя это команду можно очутиться на .главном экране.)

chmod - изменить права файла, чтоб можно было не только читать но и писать(744) 

echo - отображает набранный текст

firefox - для запуска интернета фаерфокс 

git-download - загрузить информацию из гитхаба

git-upload - загрузить историю в гитхаб

git init -sozdat  /path/to/my/codebase/.git directory

git add -sozdat suwestvujuwij fail v indeks

git config - дает возможность зайти в гитхаб

git commit - создание комита 

git clone - переместить файлы из интернета сюда(указать точный адрес сайта)

history - открыть историю проделанного

/home - домой

github - otkrivajei github (dlja trenerovki)

inbox - открывает инбокс(был создан для практики)

ls - показать файлы в этом месте

ls -l - детально рассказать о файлах(права. размер...)

mkdir - sozdat papku

mv - переименовать или переместить файл

nano - как ворд, там пишешь текст илидлинные указания. инфу можно сохранять и исправлять если что то не так

pwd - расскажет где мы(машина,дом,папка,файл), путь что мы проделали

rm - удалить файл

who - кто сидит за машиной



.. - домой

. - шаг на месте 


